In [14]:
import pandas as pd

In [15]:
import numpy as np

In [16]:
# DataFrame(data,index,column,data-type). index is rows .
# default data-type is int64

In [17]:
df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['row1','row2','row3','row4','row5'],columns=['column1','column2','column3','column4'])

In [18]:
#head() : means looking for only top 5or6 rows/records.mainly the head part.

In [19]:
df.head()

      column1  column2  column3  column4
row1        0        1        2        3
row2        4        5        6        7
row3        8        9       10       11
row4       12       13       14       15
row5       16       17       18       19

In [20]:
# csv means 'comma separated values'

In [21]:
df.to_csv('Test1.csv')

In [22]:
# accessing the elements
# two methods: loc, iloc
# here we are retrieving 1 row

In [23]:
df.loc['row2']

column1    4
column2    5
column3    6
column4    7
Name: row2, dtype: int64

In [24]:
type(df.loc['row2'])

pandas.core.series.Series

In [25]:
# for more than 1 row or column

In [26]:
df.iloc[:]

      column1  column2  column3  column4
row1        0        1        2        3
row2        4        5        6        7
row3        8        9       10       11
row4       12       13       14       15
row5       16       17       18       19

In [27]:
df.iloc[2:,:3]

      column1  column2  column3
row3        8        9       10
row4       12       13       14
row5       16       17       18

In [28]:
type(df.iloc[2:,:3])

pandas.core.frame.DataFrame

In [29]:
#converted data-frames into arrays

In [30]:
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [31]:
df.iloc[:,1:].values.shape

(5, 3)

In [32]:
#how to check null values
# means col1 has 0 null values

In [33]:
df.isnull().sum()

column1    0
column2    0
column3    0
column4    0
dtype: int64

In [34]:
df

      column1  column2  column3  column4
row1        0        1        2        3
row2        4        5        6        7
row3        8        9       10       11
row4       12       13       14       15
row5       16       17       18       19

In [35]:
df['column1'].value_counts()

0     1
4     1
8     1
12    1
16    1
Name: column1, dtype: int64

In [36]:
df['column1'].unique()

array([ 0,  4,  8, 12, 16])

In [37]:
df['column3']

row1     2
row2     6
row3    10
row4    14
row5    18
Name: column3, dtype: int64

In [38]:
# direct access

In [39]:
type(df['column3'])

pandas.core.series.Series

In [40]:
# direct access multiple columns : use lists of columns

In [41]:
df[['column3','column4']]

      column3  column4
row1        2        3
row2        6        7
row3       10       11
row4       14       15
row5       18       19

In [42]:



## video #9

In [43]:
#read_csv has a parameter "sep" means separeter (default is ',').

In [44]:
df=pd.read_csv('mercedez.csv')

In [45]:
df.head()

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
1,6,88.53,k,t,av,e,d,y,l,o,...,1,0,0,0,0,0,0,0,0,0
2,7,76.26,az,w,n,c,d,x,j,x,...,0,0,0,0,0,0,1,0,0,0
3,9,80.62,az,t,n,f,d,x,l,e,...,0,0,0,0,0,0,0,0,0,0
4,13,78.02,az,v,n,f,d,h,d,n,...,0,0,0,0,0,0,0,0,0,0

In [46]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4209 entries, 0 to 4208
Columns: 378 entries, ID to X385
dtypes: float64(1), int64(369), object(8)
memory usage: 12.1+ MB

In [47]:
# while using descrbe only int and floating values are considered. object column
# not taken into consideration
#X0,X1 ...X8 are categoral features,they are skipped when using describe()
#you cant find mean of categoral feature
# % is not percentage, it is percentile

In [48]:
df.describe()
#provides mean of particular column

,ID,y,X10,X11,X12,X13,X14,X15,X16,X17,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
count,4209.000000,4209.000000,4209.000000,4209.0,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,...,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000
mean,4205.960798,100.669318,0.013305,0.0,0.075077,0.057971,0.428130,0.000475,0.002613,0.007603,...,0.318841,0.057258,0.314802,0.020670,0.009503,0.008078,0.007603,0.001663,0.000475,0.001426
std,2437.608688,12.679381,0.114590,0.0,0.263547,0.233716,0.494867,0.021796,0.051061,0.086872,...,0.466082,0.232363,0.464492,0.142294,0.097033,0.089524,0.086872,0.040752,0.021796,0.037734
min,0.000000,72.110000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,2095.000000,90.820000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,4220.000000,99.150000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,6314.000000,109.010000,0.000000,0.0,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,...,1.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
max,8417.000000,265.320000,1.000000,0.0,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

In [49]:
# if you are giving ';' separated values (then we have to change the separter value)
# test_df= pd.read_csv('text1.csv',sep=';')

In [50]:
df['X0'].value_counts()

z     360
ak    349
y     324
ay    313
t     306
x     300
o     269
f     227
n     195
w     182
j     181
az    175
aj    151
s     106
ap    103
h      75
d      73
al     67
v      36
af     35
m      34
ai     34
e      32
ba     27
at     25
a      21
ax     19
aq     18
am     18
i      18
u      17
aw     16
l      16
ad     14
au     11
k      11
b      11
r      10
as     10
bc      6
ao      4
c       3
aa      2
q       2
ac      1
g       1
ab      1
Name: X0, dtype: int64

In [ ]:
# returns true or false a/c to the condition

In [51]:
df['y']>100

0        True
1       False
2       False
3       False
4       False
        ...
4204     True
4205     True
4206     True
4207    False
4208     True
Name: y, Length: 4209, dtype: bool

In [55]:
#returns the table after applying the condition, 
#returns only selected rows

In [52]:
df[df['y']>100]

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
6,24,128.76,al,r,e,f,d,f,h,s,...,0,0,0,0,0,0,0,0,0,0
8,27,108.67,w,s,as,e,d,f,i,h,...,1,0,0,0,0,0,0,0,0,0
9,30,126.99,j,b,aq,c,d,f,a,e,...,0,0,1,0,0,0,0,0,0,0
10,31,102.09,h,r,r,f,d,f,h,p,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4202,8402,123.34,ap,l,s,c,d,aa,d,r,...,0,0,0,0,0,0,0,0,0,0
4204,8405,107.39,ak,s,as,c,d,aa,d,q,...,1,0,0,0,0,0,0,0,0,0
4205,8406,108.77,j,o,t,d,d,aa,h,h,...,0,1,0,0,0,0,0,0,0,0
4206,8412,109.22,ak,v,r,a,d,aa,g,e,...,0,0,1,0,0,0,0,0,0,0
4208,8417,110.85,z,r,ae,c,d,aa,g,w,...,1,0,0,0,0,0,0,0,0,0

In [53]:
# CSV

In [57]:
from io import StringIO, BytesIO

In [58]:
data= ('col1,col2,col3\n'
          'x,y,1\n'
          'a,b,2\n'
          'c,d,3')

In [59]:
type(data)

str

In [60]:
# stringIO creates a text memory buffer

In [67]:
# StringIO :
# Init signature: StringIO(initial_value='', newline='\n')
# Docstring:     
# Text I/O implementation using an in-memory buffer.

In [62]:
pd.read_csv(StringIO(data))

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [46]:
df=pd.read_csv(StringIO(data),usecols=['col1','col3'])

In [47]:
df.to_csv('test2.csv')

In [48]:
df

  col1  col3
0    x     1
1    a     2
2    c     3

In [68]:
# specifying column data types

In [71]:
data = ('a,b,c,d\n'
       '1,2,3,4\n'
        '5,6,7,8\n'
       '9,10,11\n')

In [72]:
print(data)

a,b,c,d
1,2,3,4
5,6,7,8
9,10,11

In [73]:
data

'a,b,c,d\n1,2,3,4\n5,6,7,8\n9,10,11\n'

In [74]:
df=pd.read_csv(StringIO(data), dtype=object)

In [75]:
# all elements become object.
# object in this data-frame means they become strings.

In [76]:
df

   a   b   c    d
0  1   2   3    4
1  5   6   7    8
2  9  10  11  NaN

In [77]:
print(df)

   a   b   c    d
0  1   2   3    4
1  5   6   7    8
2  9  10  11  NaN

In [78]:
# difference between print(df) and df

In [79]:
df['a']

0    1
1    5
2    9
Name: a, dtype: object

In [83]:
df['a'][1]

'5'